aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/mcufunc/mcu_setup.c
    /* 割り込み許可 */
    /*=================================================================*/
                            /*  +------------------------- 7 : -       */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : -       */
                            /*  | | | +------------------- 4 : -       */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : -       */
                            /*  | | | |     | +----------- 2 : -       */
                            /*  | | | |     | | +--------- 1 : CCP2IE  */   /* ECCP2 割り込み　無効 */  /* @@どの機能使うかで役割変わるので後で再チェック */
                            /*  | | | |     | | | + ------ 0 : CCP1IE  */   /* ECCP1 割り込み　無効 */
    PIE6 = 0x00U;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /* 割り込み優先度 */
    /*=================================================================*/
                            /*  +------------------------- 7 : -       */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : -       */
                            /*  | | | +------------------- 4 : -       */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : -       */
                            /*  | | | |     | +----------- 2 : -       */
                            /*  | | | |     | | +--------- 1 : CCP2IP  */
                            /*  | | | |     | | | + ------ 0 : CCP1IP  */
    IPR6 = 0x00U;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /* 割り込みフラグ */
    /*=================================================================*/
                            /*  +------------------------- 7 : -       */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : -       */
                            /*  | | | +------------------- 4 : -       */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : -       */
                            /*  | | | |     | +----------- 2 : -       */
                            /*  | | | |     | | +--------- 1 : CCP2IF  */
                            /*  | | | |     | | | + ------ 0 : CCP1IF  */
    PIR6 = 0x00U;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/




    /* 割り込み許可 */
    /*=================================================================*/
                            /*  +------------------------- 7 : SCANIE  */   /* SCAN 割り込み　無効 */
                            /*  | +----------------------- 6 : CRCIE   */   /* CRC 割り込み　無効 */
                            /*  | | +--------------------- 5 : NVMIE   */   /* NVM 割り込み　無効 */
                            /*  | | | +------------------- 4 : -       */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : -       */
                            /*  | | | |     | +----------- 2 : -       */
                            /*  | | | |     | | +--------- 1 : -       */
                            /*  | | | |     | | | + ------ 0 : CWG1IE  */   /* CWG割り込み　無効 */ /* @@相補PWMやるときまた考える */
    PIE7 = 0x00U;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/


    /* 割り込みフラグ */
    /*=================================================================*/
                            /*  +------------------------- 7 : SCANIP  */
                            /*  | +----------------------- 6 : CRCIP   */
                            /*  | | +--------------------- 5 : NVMIP   */
                            /*  | | | +------------------- 4 : -       */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : -       */
                            /*  | | | |     | +----------- 2 : -       */
                            /*  | | | |     | | +--------- 1 : -       */
                            /*  | | | |     | | | + ------ 0 : CWG1IP  */
    IPR7 = 0x00U;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/


    /* 割り込みフラグ */
    /*=================================================================*/
                            /*  +------------------------- 7 : SCANIF  */
                            /*  | +----------------------- 6 : CRCIF   */
                            /*  | | +--------------------- 5 : NVMIF   */
                            /*  | | | +------------------- 4 : -       */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : -       */
                            /*  | | | |     | +----------- 2 : -       */
                            /*  | | | |     | | +--------- 1 : -       */
                            /*  | | | |     | | | + ------ 0 : CWG1IF  */
    PIR7 = 0x00U;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/
}


/**************************************************************/
/*  Function:                                                 */
/*  ポート初期設定                                            */
/*                                                            */
/**************************************************************/
static void func_mset_s_port_setup( void )
{
    /* ポート入出力方向設定 */
    /*=================================================================*/
                            /*  +------------------------- 7 : TRISA7  */   /* OUT：ウィンカー右ランプ */
                            /*  | +----------------------- 6 : TRISA6  */   /* OUT：ブレーキランプ */
                            /*  | | +--------------------- 5 : TRISA5  */   /* OUT：ウィンカー左ランプ */
                            /*  | | | +------------------- 4 : TRISA4  */   /* IN：レブリミットレベル */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : TRISA3  */   /* IN：シフトチェンジ入力 */
                            /*  | | | |     | +----------- 2 : TRISA2  */   /* IN：加速力調節 */
                            /*  | | | |     | | +--------- 1 : TRISA1  */   /* IN：マニュアル/オートマ選択 */
                            /*  | | | |     | | | + ------ 0 : TRISA0  */   /* IN：前進/後退 入力 */
    TRISA = 0x18U;          /*  0 0 0 1  -  1 1 1 1                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 0:出力、1:入力                                                   */
    /* RA4は入力専用ポートなので注意                                     */
    /*=================================================================*/

