aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/mcufunc/mcu_setup.c
    /* ポート入力バッファの種類 選択レジスタ */
    /*=================================================================*/
                            /*  +------------------------- 7 : SLRA7   */
                            /*  | +----------------------- 6 : SLRA6   */
                            /*  | | +--------------------- 5 : SLRA5   */
                            /*  | | | +------------------- 4 : SLRA4   */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : SLRA3   */
                            /*  | | | |     | +----------- 2 : SLRA2   */
                            /*  | | | |     | | +--------- 1 : SLRA1   */
                            /*  | | | |     | | | + ------ 0 : SLRA0   */
    INLVLA = 0xFFU;         /*  1 1 1 1  -  1 1 1 1                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 0：入力読み取りは TTL バッファを使う                               */
    /* 1：入力読み取りは  ST バッファを使う                               */    /* こっちのほうがL->H遷移の閾値高いので安定 */
    /*=================================================================*/

    /*===================================================================================================================================================================*/


    /* ポート入出力方向設定 */
    /*=================================================================*/
                            /*  +------------------------- 7 : TRISB7  */   /* 書き込み専用 */
                            /*  | +----------------------- 6 : TRISB6  */   /* 書き込み専用 */
                            /*  | | +--------------------- 5 : TRISB5  */   /* OUT：フロントライト */
                            /*  | | | +------------------- 4 : TRISB4  */   /* OUT：強制ニュートラル信号 出力 */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : TRISB3  */   /* OUT：シフト2 出力 */
                            /*  | | | |     | +----------- 2 : TRISB2  */   /* OUT：シフト1 出力 */
                            /*  | | | |     | | +--------- 1 : TRISB1  */   /* OUT：シフト0 出力 */
                            /*  | | | |     | | | + ------ 0 : TRISB0  */   /* OUT：デバッグ用GPIO出力 */
    TRISB = 0x00U;          /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 0:出力、1:入力                                                   */
    /* RA4は入力専用ポートなので注意                                     */
    /*=================================================================*/

    /* ポート読み取り　レジスタ */
    /*=================================================================*/
                            /*  +------------------------- 7 : RB7     */
                            /*  | +----------------------- 6 : RB6     */
                            /*  | | +--------------------- 5 : RB5     */
                            /*  | | | +------------------- 4 : RB4     */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : RB3     */
                            /*  | | | |     | +----------- 2 : RB2     */
                            /*  | | | |     | | +--------- 1 : RB1     */
                            /*  | | | |     | | | + ------ 0 : RB0     */
    PORTB = 0x00U;          /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /* ポート書き込み レジスタ */
    /*=================================================================*/
                            /*  +------------------------- 7 : LATB7   */
                            /*  | +----------------------- 6 : LATB6   */
                            /*  | | +--------------------- 5 : LATB5   */
                            /*  | | | +------------------- 4 : LATB4   */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : LATB3   */
                            /*  | | | |     | +----------- 2 : LATB2   */
                            /*  | | | |     | | +--------- 1 : LATB1   */
                            /*  | | | |     | | | + ------ 0 : LATB0   */
    LATB = 0x00U;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /* GPIO or アナログ入力選択 */
    /*=================================================================*/
                            /*  +------------------------- 7 : ANSELB7 */
                            /*  | +----------------------- 6 : ANSELB6 */
                            /*  | | +--------------------- 5 : ANSELB5 */
                            /*  | | | +------------------- 4 : ANSELB4 */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : ANSELB3 */
                            /*  | | | |     | +----------- 2 : ANSELB2 */
                            /*  | | | |     | | +--------- 1 : ANSELB1 */
                            /*  | | | |     | | | + ------ 0 : ANSELB0 */
    ANSELB = 0x00U;         /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 0:デジタル入出力                                                 */
    /* 1:アナログ入力                                                   */
    /*=================================================================*/

    
    /* 内部プルアップ設定(ただし弱い) レジスタ */
    /*=================================================================*/
                            /*  +------------------------- 7 : WPUB7   */
                            /*  | +----------------------- 6 : WPUB6   */
                            /*  | | +--------------------- 5 : WPUB5   */
                            /*  | | | +------------------- 4 : WPUB4   */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : WPUB3   */
                            /*  | | | |     | +----------- 2 : WPUB2   */
                            /*  | | | |     | | +--------- 1 : WPUB1   */
                            /*  | | | |     | | | + ------ 0 : WPUB0   */
    WPUB = 0x00U;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 0：内部プルアップ無効                                             */
    /* 1：内部プルアップ有効                                             */
    /*=================================================================*/

