aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/mcufunc/mcu_setup.c
    /* GPIO or アナログ入力選択 */
    /*=================================================================*/
                            /*  +------------------------- 7 : ANSELC7 */
                            /*  | +----------------------- 6 : ANSELC6 */
                            /*  | | +--------------------- 5 : ANSELC5 */
                            /*  | | | +------------------- 4 : ANSELC4 */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : ANSELC3 */
                            /*  | | | |     | +----------- 2 : ANSELC2 */   /* アナログ入力：バッテリ低電圧検出 */
                            /*  | | | |     | | +--------- 1 : ANSELC1 */
                            /*  | | | |     | | | + ------ 0 : ANSELC0 */
    ANSELC = 0x04U;         /*  0 0 0 0  -  0 1 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 0:デジタル入出力                                                 */
    /* 1:アナログ入力                                                   */
    /*=================================================================*/

    /* 内部プルアップ設定(ただし弱い) レジスタ */
    /*=================================================================*/
                            /*  +------------------------- 7 : WPUC7   */
                            /*  | +----------------------- 6 : WPUC6   */
                            /*  | | +--------------------- 5 : WPUC5   */
                            /*  | | | +------------------- 4 : WPUC4   */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : WPUC3   */
                            /*  | | | |     | +----------- 2 : WPUC2   */
                            /*  | | | |     | | +--------- 1 : WPUC1   */
                            /*  | | | |     | | | + ------ 0 : WPUC0   */
    WPUC = 0x00U;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 0：内部プルアップ無効                                             */
    /* 1：内部プルアップ有効                                             */
    /*=================================================================*/

    /* オープンドレイン制御 レジスタ */
    /*=================================================================*/
                            /*  +------------------------- 7 : ODCC7   */
                            /*  | +----------------------- 6 : ODCC6   */
                            /*  | | +--------------------- 5 : ODCC5   */
                            /*  | | | +------------------- 4 : ODCC4   */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : ODCC3   */
                            /*  | | | |     | +----------- 2 : ODCC2   */
                            /*  | | | |     | | +--------- 1 : ODCC1   */
                            /*  | | | |     | | | + ------ 0 : ODCC0   */
    ODCONC = 0x00U;         /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 0：プッシュプル　シンク/ソース両方向                               */
    /* 1：オープンドレイン有効　シンク方向のみ                             */
    /*=================================================================*/

    /* ポートスルーレート制御 レジスタ */
    /*=================================================================*/
                            /*  +------------------------- 7 : SLRC7   */
                            /*  | +----------------------- 6 : SLRC6   */
                            /*  | | +--------------------- 5 : SLRC5   */
                            /*  | | | +------------------- 4 : SLRC4   */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : SLRC3   */
                            /*  | | | |     | +----------- 2 : SLRC2   */
                            /*  | | | |     | | +--------- 1 : SLRC1   */
                            /*  | | | |     | | | + ------ 0 : SLRC0   */
    SLRCONC = 0x00U;        /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 0：スルーレート 最大　　                                          */
    /* 1：スルーレート 制限付き                                          */
    /*=================================================================*/

    
    /* ポート入力バッファの種類 選択レジスタ */
    /*=================================================================*/
                            /*  +------------------------- 7 : SLRA7   */
                            /*  | +----------------------- 6 : SLRA6   */
                            /*  | | +--------------------- 5 : SLRA5   */
                            /*  | | | +------------------- 4 : SLRA4   */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : SLRA3   */
                            /*  | | | |     | +----------- 2 : SLRA2   */
                            /*  | | | |     | | +--------- 1 : SLRA1   */
                            /*  | | | |     | | | + ------ 0 : SLRA0   */
    INLVLC = 0xFFU;         /*  1 1 1 1  -  1 1 1 1                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 0：入力読み取りは TTL バッファを使う                               */
    /* 1：入力読み取りは  ST バッファを使う                               */    /* こっちのほうがL->H遷移の閾値高いので安定 */
    /*=================================================================*/


