aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/mcufunc/mcu_setup.c
    /*=====================================================================================================================================================================*/


    /* ポート入出力方向設定 */
    /* TRISE は存在しない */

    /* ポート読み取り　レジスタ */
    /*=================================================================*/
                            /*  +------------------------- 7 : -       */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : -       */
                            /*  | | | +------------------- 4 : -       */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : RE3     */   /* MCLREで使用予定 リセット専用 */
                            /*  | | | |     | +----------- 2 : -       */
                            /*  | | | |     | | +--------- 1 : -       */
                            /*  | | | |     | | | + ------ 0 : -       */
    PORTE = 0x00U;          /*  # # # #  -  0 # # #                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /* LATAC は存在しない */

    /* ANSELC は存在しない */

    /* 内部プルアップ設定(ただし弱い) レジスタ */
    /*=================================================================*/
                            /*  +------------------------- 7 : WPUE7   */
                            /*  | +----------------------- 6 : WPUE6   */
                            /*  | | +--------------------- 5 : WPUE5   */
                            /*  | | | +------------------- 4 : WPUE4   */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : WPUE3   */
                            /*  | | | |     | +----------- 2 : WPUE2   */
                            /*  | | | |     | | +--------- 1 : WPUE1   */
                            /*  | | | |     | | | + ------ 0 : WPUE0   */
    WPUE = 0x00U;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 0：内部プルアップ無効                                             */
    /* 1：内部プルアップ有効                                             */
    /*=================================================================*/

    /* ODCONE は存在しない */

    /* SLRCONC は存在しない */
    
    /* ポート入力バッファの種類 選択レジスタ */
    /*=================================================================*/
                            /*  +------------------------- 7 : SLRA7   */
                            /*  | +----------------------- 6 : SLRA6   */
                            /*  | | +--------------------- 5 : SLRA5   */
                            /*  | | | +------------------- 4 : SLRA4   */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : SLRA3   */
                            /*  | | | |     | +----------- 2 : SLRA2   */
                            /*  | | | |     | | +--------- 1 : SLRA1   */
                            /*  | | | |     | | | + ------ 0 : SLRA0   */
    INLVLE = 0x08U;         /*  # # # #  -  1 # # #                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 0：入力読み取りは TTL バッファを使う                               */
    /* 1：入力読み取りは  ST バッファを使う                               */    /* こっちのほうがL->H遷移の閾値高いので安定 */
    /*=================================================================*/
}


/**************************************************************/
/*  Function:                                                 */
/*  AD変換初期設定                                            */
/*                                                            */
/**************************************************************/
static void func_mset_s_adc_setup( void )
{
    /* AD変換設定1 */
    /*==================================================================*/
                            /*  +------------------------- 7 : -        */
                            /*  | +----------------------- 6 : CHS4     */
                            /*  | | +--------------------- 5 : CHS3     */
                            /*  | | | +------------------- 4 : CHS2     */
                            /*  | | | |                                 */
                            /*  | | | |     +------------- 3 : CHS1     */
                            /*  | | | |     | +----------- 2 : CHS0     */  /* 初期化時はいったん AN0指定 */
                            /*  | | | |     | | +--------- 1 : GO/nDONE */  /* 初期化時は実行しない */
                            /*  | | | |     | | | + ------ 0 : ADON     */  /* 初期化時にAD変換ユニット 無効化 -> プログラム開始時にONする */
    ADCON0 = 0x00U;         /*  0 0 0 0  -  0 0 0 1                     */
    /*------------------------------------------------------------------*/
    /* memo                                                             */
    /*                                                                  */
    /*==================================================================*/

    /* AD変換設定2 */
    /*==================================================================*/
                            /*  +------------------------- 7 : ADFM     */  /* 右詰め LSBから埋めてく */
                            /*  | +----------------------- 6 : ADCS2    */
                            /*  | | +--------------------- 5 : ADCS1    */
                            /*  | | | +------------------- 4 : ADCS0    */  /* 110:クロック32MHzのため、Fosc/64に設定 */
                            /*  | | | |                                 */
                            /*  | | | |     +------------- 3 : -        */
                            /*  | | | |     | +----------- 2 : ADNREF   */  /* 負側の電位基準：VSS(GND) */
                            /*  | | | |     | | +--------- 1 : ADPREF1  */
                            /*  | | | |     | | | + ------ 0 : ADPREF0  */  /* 正側の電位基準：AVDD */
    ADCON1 = 0xA0U;         /*  1 0 1 0  -  0 0 0 0                     */
    /*------------------------------------------------------------------*/
    /* memo                                                             */
    /*                                                                  */
    /*==================================================================*/

    /* AD変換設定3 */
    /*==================================================================*/
                            /*  +------------------------- 7 : -        */
                            /*  | +----------------------- 6 : -        */
                            /*  | | +--------------------- 5 : -        */
                            /*  | | | +------------------- 4 : -        */
                            /*  | | | |                                 */
                            /*  | | | |     +------------- 3 : -        */
                            /*  | | | |     | +----------- 2 : -        */
                            /*  | | | |     | | +--------- 1 : ADRES9   */
                            /*  | | | |     | | | + ------ 0 : ADRES8   */
    ADRESH = 0x00U;         /*  0 0 0 0  -  0 0 0 0                     */
    /*------------------------------------------------------------------*/
    /* memo                                                             */
    /* ADFMの設定内容によって右詰め、左詰め変わるので注意                   */
    /*==================================================================*/

    /* AD変換設定3 */
    /*==================================================================*/
                            /*  +------------------------- 7 : ADRES7   */
                            /*  | +----------------------- 6 : ADRES6   */
                            /*  | | +--------------------- 5 : ADRES5   */
                            /*  | | | +------------------- 4 : ADRES4   */
                            /*  | | | |                                 */
                            /*  | | | |     +------------- 3 : ADRES3   */
                            /*  | | | |     | +----------- 2 : ADRES2   */
                            /*  | | | |     | | +--------- 1 : ADRES1   */
                            /*  | | | |     | | | + ------ 0 : ADRES0   */
    ADRESL = 0x00U;         /*  0 0 0 0  -  0 0 0 0                     */
    /*------------------------------------------------------------------*/
    /* memo                                                             */
    /* ADFMの設定内容によって右詰め、左詰め変わるので注意                   */
    /*==================================================================*/
}




/**************************************************************/
/*  Function:                                                 */
/*  タイマ初期設定                                            */
/*                                                            */
/**************************************************************/
static void func_mset_s_timer_setup( void )
{
    func_mset_s_timer0_setup();     /* メインタスク用 タイマ0 */

